console.log('На мой взгляд работа выполнена полностью.');
console.log('1. Релизован выбор любого древнего.');
console.log('2. Реализовано 5 сложностей.');
console.log('3. Карты замешиваются согласно правилам игры. Это можно проследить по консоли. Я отсавил вывод самых вжных этапов.');
console.log('2. Есть треккер текущего состояния колоды.\n');
console.log('Хочу отметить, что я реализовал также и дополнительные функциональности. Например просмотр карты вблизи.');
console.log('К коду конечно есть вопросы, и все можно сделать изящнее, но время мне не дает такой возможности.');
console.log('В любом случае, приятной проверки. Надеюсь она дастся легко.');